In [2]:
import sqlite3

## Read Data From Database

In [14]:
connection = sqlite3.connect("weather.db")
rows = connection.execute("SELECT * FROM users").fetchall()
connection.close()
rows

[(3, 'eman', 'Giza', 20),
 (12, 'Eslam Ahmed', 'Cairo', 20),
 (15, 'hamada', 'Cairo', 22),
 (19, 'Medhat', 'Maadi', 22),
 (22, 'Menna', 'Cairo', 22),
 (23, 'Ezz', 'Giza', 22),
 (25, 'Menna', 'Cairo', 22),
 (26, 'Ebrahem', 'Giza', 35),
 (27, 'Ebrahem', 'Giza', 35),
 (28, 'Ebrahem', 'Giza', 35),
 (29, 'Ebrahem', 'Giza', 35),
 (30, 'Ahmed', 'Giza', 25)]

In [7]:
for uid,name,city,age  in rows:
    print(f'user with id {uid} has name {name} lives in {city} and his age = {age}')

user with id 3 has name eman lives in Giza and his age = 20
user with id 12 has name Eslam Ahmed lives in Cairo and his age = 20
user with id 15 has name hamada lives in Cairo and his age = 22
user with id 19 has name Medhat lives in Maadi and his age = 22
user with id 22 has name Menna lives in Cairo and his age = 22
user with id 23 has name Ezz lives in Giza and his age = 22
user with id 25 has name Menna lives in Cairo and his age = 22

## Use Pandas to execute sql

In [5]:
import pandas as pd

connection = sqlite3.connect("weather.db")
df = pd.read_sql("SELECT * from users", connection)
connection.close()
df.head()

   id         name   city  age
0   3         eman   Giza   20
1  12  Eslam Ahmed  Cairo   20
2  15       hamada  Cairo   22
3  19       Medhat  Maadi   22
4  22        Menna  Cairo   22

In [8]:
city_input = input('search for city: ')

connection = sqlite3.connect("weather.db")
rows = connection.execute("SELECT * FROM users WHERE city = ?", [city_input]).fetchall()
connection.close()

for uid,name,city,age  in rows:
    print(f'user with id {uid} has name {name} lives in {city} and his age = {age}')

search for city: Cairo
user with id 12 has name Eslam Ahmed lives in Cairo and his age = 20
user with id 15 has name hamada lives in Cairo and his age = 22
user with id 22 has name Menna lives in Cairo and his age = 22
user with id 25 has name Menna lives in Cairo and his age = 22

## Insert Data into Database

In [12]:
connection = sqlite3.connect("weather.db")
cursor = connection.execute("INSERT INTO users (name,city,age) VALUES (?, ?, ?)", ['Ebrahem', 'Giza', '35'])
connection.commit()
connection.close()
cursor.lastrowid

29

In [13]:
connection = sqlite3.connect("weather.db")
cursor = connection.execute("INSERT INTO users (name,city,age) VALUES (?, ?, ?)", ['Ahmed', 'Giza', '25'])
connection.commit()
connection.close()
cursor.lastrowid

30

In [15]:
name = input('Enter user name: ')
city = input('Enter user city: ')
age = input('Enter user age: ')

connection = sqlite3.connect("weather.db")
cursor = connection.execute("INSERT INTO users (name,city,age) VALUES (?, ?, ?)", [name, city, age])
connection.commit()
connection.close()

cursor.lastrowid

Enter user name: mohammed
Enter user city: Maadi
Enter user age: 20

31

## Update Data in Database

In [17]:
connection = sqlite3.connect("weather.db")
cursor = connection.execute("UPDATE users SET name=?, age=? WHERE id=? ", ['Ezz', 22, 31])
connection.commit()
connection.close()

## Delete Data in Database

In [18]:
connection = sqlite3.connect("weather.db")
cursor = connection.execute("DELETE FROM users WHERE age >= ? ", [30])
connection.commit()
connection.close()

## Good Job!